<!-- dflook/terraform-github-actions {"workspace":"dflook-patch-1","backend_type":"remote","plan_modifier":"b0290c8150ae92d755bd7f79918a5400b47951132d040bb679259d282742cb6d","backend":"795b7e51395b5cad4332c681744a8aadfddaf179574c58b2a8d9aae1cfc1f5e5","plan_job_ref":"Job Test actions using target, replace, and exclude #20 at https://github.com/dflook/terraform-github-actions/actions/runs/17349369244","plan_hash":"e16657dabd130c4240a0860da3b56c2183038a916cf42b4b7eac5043c9dc0be2","plan_text_format":"diff","version":"99.0.0","closed":true} -->
Terraform plan in __tests/workflows/test-target-replace-exclude__ in the __dflook-patch-1__ workspace
Targeting resources: `random_string.count[0]`
With variables: `length = 5`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_string.count[0] will be created
+   resource "random_string" "count" {
+       id          = (known after apply)
+       length      = 5
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = false
+       upper       = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   count = (known after apply)
╷
│ Warning: Resource targeting is in effect
│ 
│ You are creating a plan with the -target option, which means that the
│ result of this plan may not represent all of the changes requested by the
│ current configuration.
│ 		
│ The -target option is not for routine use, and is provided only for
│ exceptional situations such as recovering from errors or mistakes, or when
│ Terraform specifically suggests to use it as part of an error message.
╵
```
</details>

:white_check_mark: Plan applied in [Test actions using target, replace, and exclude #20](https://github.com/dflook/terraform-github-actions/actions/runs/17349369244)
<details open><summary>Outputs</summary>

```hcl
count = "kEoH0"
```
</details>